ninety_nine_cats/app/views/cat_rental_requests/new.html.erb

SELECT "cats".* FROM "cats"
---
        <option disabled selected>--select your rental kitty--</option>
        <% Cat.all.each do |cat| %>