ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

    def create
        @request = CatRentalRequest.new(request_params)
        if @request.save
            cat = Cat.find_by(id: @request.cat_id)
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "2017-04-15"], ["end_date", "2017-06-15"], ["created_at", "2021-02-08 02:54:44.760595"], ["updated_at", "2021-02-08 02:54:44.760595"]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def approve
        req = CatRentalRequest.find_by(id: params[:cat_rental_request_id])
        req.approve!
        cat = Cat.find_by(id: req.cat_id)
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]