ninety_nine_cats/app/controllers/cats_controller.rb

    def index
        @cats = Cat.all.order('id')
---
SELECT "cats".* FROM "cats" ORDER BY id

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("name", "birth_date", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find(params[:id])  #user = User.find(params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["name", "Magic Man The Sequel"], ["description", ""], ["updated_at", "2021-02-06 22:25:34.198440"], ["id", 1]]