ninety_nine_cats/app/models/cat_rental_request.rb

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-02-08 02:40:50.384460"], ["id", 2]]
---
    def approve!
        CatRentalRequest.transaction do
            self.status = 'APPROVED'
            self.save!

SELECT "cat_rental_requests"."id" FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2020-05-20' OR end_date < '2020-04-20') AND "cat_rental_requests"."status" = $2  [["cat_id", 4], ["status", "PENDING"]]
---
    def overlapping_pending_requests
        self.overlapping_requests.where(status: 'PENDING')